'''
      1. 模拟'斗地主'发牌
    牌共54张
    花色:
       黑桃('\u2660'), 梅花('\u2663'), 方块('\u2665'), 红桃('\u2666')
    大小王
    数字:
       A0~10JQK
    1) 生成54张片
    2) 三个人玩牌，每人发17张,底牌留三张
      输入回车, 打印第1个人的17张牌
      输入回车, 打印第2个人的17张牌
      输入回车, 打印第3个人的17张牌
      输入回车, 打印3张底牌
'''

import random

color = ['\u2660','\u2663','\u2665','\u2666']     # 黑红梅方四花色
poker = ['大王','小王']     # 大小王
num = ['A','2','3','4','5','6','7','8','9','10','J','Q','K']    # 数字
for c in color:     # 遍历花色
    for x in num:   # 数字
        p = c + x   # 拼成一张牌
        poker.append(p)
print("完整扑克",poker)
random.shuffle(poker)  # 打乱扑克顺序
input()
print("第一个人的牌为:",poker[:17])
input()
print("第二个人的牌为:",poker[17:34])
input()
print("第三个人的牌为:",poker[34:51])
input()
print("底牌为:",poker[-3:])